face_id_dict = {
    0: "微笑", 1: "撇嘴", 2: "色", 3: "发呆", 4: "得意", 5: "流泪", 6: "害羞", 7: "闭嘴", 8: "睡", 9: "大哭",
    10: "尴尬", 11: "发怒", 12: "调皮", 13: "呲牙", 14: "惊讶", 15: "难过", 16: "酷", 17: "冷汗", 18: "抓狂", 19: "吐",
    20: "偷笑", 21: "可爱", 22: "白眼", 23: "傲慢", 24: "饥饿", 25: "困", 26: "惊恐", 27: "流汗", 28: "憨笑", 29: "大兵",
    30: "奋斗", 31: "咒骂", 32: "疑问", 33: "嘘", 34: "晕", 35: "折磨", 36: "衰", 37: "骷髅", 38: "敲打", 39: "再见",
    40: "擦汗", 41: "抠鼻", 42: "鼓掌", 43: "糗大了", 44: "坏笑", 45: "左哼哼", 46: "右哼哼", 47: "哈欠", 48: "鄙视", 49: "委屈",
    50: "快哭了", 51: "阴险", 52: "亲亲", 53: "吓", 54: "可怜", 55: "菜刀", 56: "西瓜", 57: "啤酒", 58: "篮球", 59: "乒乓",
    60: "咖啡", 61: "饭", 62: "猪头", 63: "玫瑰", 64: "凋谢", 65: "示爱", 66: "爱心", 67: "心碎", 68: "蛋糕", 69: "闪电",
    70: "炸弹", 71: "刀", 72: "足球", 73: "瓢虫", 74: "便便", 75: "月亮", 76: "太阳", 77: "礼物", 78: "拥抱", 79: "强",
    80: "弱", 81: "握手", 82: "胜利", 83: "抱拳", 84: "勾引", 85: "拳头", 86: "差劲", 87: "爱你", 88: "NO", 89: "OK",
    90: "爱情", 91: "飞吻", 92: "跳跳", 93: "发抖", 94: "怄火", 95: "转圈", 96: "磕头", 97: "回头", 98: "跳绳", 99: "挥手",
    100: "激动", 101: "街舞", 102: "献吻", 103: "左太极", 104: "右太极", 105: "哈哈", 106: "捂脸", 107: "奸笑", 108: "机智", 109: "皱眉",
    110: "耶", 111: "鬼脸", 112: "生病", 113: "拜托", 114: "点赞", 115: "无奈", 116: "托腮", 117: "思考", 118: "再见2", 119: "翻白眼",
    120: "哈欠2", 121: "奋斗2", 122: "拥抱2", 123: "爆哭", 124: "扶额", 125: "抠鼻2", 126: "打脸", 127: "惊呆", 128: "喷血", 129: "斜眼笑",
    130: "烧香", 131: "发呆2", 132: "裂开", 133: "让我看看", 134: "叹气", 135: "苦涩", 136: "裂开2", 137: "让我想想", 138: "哦哟", 139: "忐忑",
    140: "不失礼貌", 141: "旺柴", 142: "舔屏", 143: "加油抱拳", 144: "汗", 145: "天啊", 146: "Emm", 147: "社会社会", 148: "旺旺", 149: "好的"
}

ACHIEVEMENT_IDMAP = {
    1:"10/102339", # 礼物盒
    2:"82/820265", # 骰子
    3:"65/655481", # 身份卡
    4:"59/595167", # 告示牌
    5:"18/188583", # 虾
    6:"17/177434", # 鱼
    7:"0/925", # 土豆
    8:"83/831524", # 日记本
    9:"52/527399", # 镜子
    10:"66/668414", # 艾斯
    11:"52/527413", # 信
    12:"0/960", # 金锭
    13:"0/961", # 金粒
    14:"0/960", # 金锭
    15:"43/430696", # 沙漏
    16:"82/829197" # 金锭
}
ACHIEVEMENT_DATA = {
    1:{"id": 1,"title":"时神的礼物","description":"使用超级丝瓜卡", "rarity":"epic"},
    2:{"id": 2,"title":"冒险，于薄暮启程","description":"4点半前游玩福瑞大冒险", "rarity":"epic"},
    3:{"id": 3,"title":"我也是有身份的人","description":"成功绑定了QQ", "rarity":"common"},
    4:{"id": 4,"title":"君の名は","description":"Kimi no na wa", "rarity":"uncommon"},
    5:{"id": 5,"title":"舞萌吃蒸虾头","description":"闭店时间使用会让bot鼠掉的命令", "rarity":"epic"},
    6:{"id": 6,"title":"鱼降临","description":"赞美水鱼", "rarity":"epic"},
    7:{"id": 7,"title":"读秒大王","description":"成为今天第一个挖土豆的用户", "rarity":"epic"},
    8:{"id": 8,"title":"彩虹的尽头","description":"艾斯没能等到晴天。", "rarity":"epic"},
    9:{"id": 9,"title":"镜中自我","description":"查询你自己的每日鉴毛", "rarity":"common"},
    10:{"id": 10,"title":"我叫艾斯，你叫什么","description":"成功为毛毛投稿了别名", "rarity":"common"},
    11:{"id": 11,"title":"风带来远方的消息","description":"投稿毛毛星期五并收到回复", "rarity":"rare"},
    12:{"id": 12,"title":"富兽太","description":"单次打榜消耗4096根以上呆毛", "rarity":"epic"},
    13:{"id": 13,"title":"安慰奖","description":"这是给你的奖励（？", "rarity":"common"},
    14:{"id": 14,"title":"豪掷千金","description":"兑换狼狼骰单次消耗超过1024呆毛", "rarity":"epic"},
    15:{"id": 15,"title":"过去的证明","description":"带着它们，前往下一个未来吧", "rarity":"common"},
    16:{"id": 16,"title":"于花海重逢","description":"使用福瑞大冒险的特殊圣物", "rarity":"epic"}
}